Repository: Sergey842248/Substitute
Catalog: lib/l10n/app_*.arb
Languages: de

source: Settings
de: Einstellungen

source: Credentials
de: Anmeldeinformationen

# credentialsSubtitle
source: stundenplan24 credentials
de: stundenplan24 Anmeldeinformationen

source: Notifications
de: Benachrichtigungen

# notificationsSubtitle
source: Notifications for substitution plan
de: Benachrichtigungen für den Vertretungsplan

source: Set Teacher abbreviations
de: Lehrerkürzel festlegen

# setTeacherAbbreviationsSubtitle
source: Replace teacher abbreviations with Real ones
de: Lehrerkürzel durch echte Namen ersetzen

source: Developer options
de: Entwickleroptionen

# developerOptionsSubtitle
source: Change Settings meant for developers
de: Einstellungen für Entwickler ändern

source: Language
de: Sprache

# languageSubtitle
source: Change the language of the app
de: Sprache der App ändern

# freeRoomsTitle
source: Free rooms - {time}
de: Freie Räume - {time}

source: vplan students
de: Vertretungsplan Schüler

source: vplan teachers
de: Vertretungsplan Lehrer

source: New version available
de: Neue Version verfügbar

# newVersionMessage
source: A new version ({version}) is available. Download now!
de: Eine neue Version ({version}) ist verfügbar. Jetzt herunterladen!

source: Later
de: Später

source: Download
de: Herunterladen

source: Main-Developer:
de: Hauptentwickler:

source: Former Developer:
de: Ehemaliger Entwickler:

source: Open Issue
de: Issue öffnen

source: Find free room
de: Freien Raum finden

# findFreeRoomSubtitle
source: Find a room which isn't occupied for a specific time
de: Einen Raum finden, der zu einer bestimmten Zeit nicht belegt ist

source: Analysis
de: Analyse

# analysisSubtitle
source: Get an analysis of the substitution plan
de: Eine Analyse des Vertretungsplans erhalten

# settingsTitle
source: Settings
de: Einstellungen

# settingsSubtitle
source: More Settings to personalize your experience
de: Weitere Einstellungen zur Personalisierung Ihrer Erfahrung

# addNewClass
source: Add a new class
de: Neue Klasse hinzufügen

# dontForgetCredentials
source: Don't forget your credentials!
de: Vergiss deine Anmeldedaten nicht!

source: Add
de: Hinzufügen

# selectClass
source: Select a class
de: Klasse auswählen

source: No next lesson found
de: Keine nächste Stunde gefunden

source: next hour
de: nächste Stunde

# room
source: Room {room}
de: Raum {room}

source: Class selection
de: Klassenauswahl

# selectClassTitle
source: Select class
de: Klasse auswählen

# usernamePasswordWrong
source: Username or password incorrect!
de: Benutzername oder Passwort falsch!

# wrongSchoolNumber
source: Wrong schoolnumber! or no substitution plan available!
de: Falsche Schulnummer! oder kein Vertretungsplan verfügbar!

source: No internet connection
de: Keine Internetverbindung

source: no substitution plan
de: kein Vertretungsplan

# wrongSchoolNumberAlt
source: Wrong school-number or no substitution plan available
de: Falsche Schulnummer oder kein Vertretungsplan verfügbar

source: No Network connection
de: Keine Netzwerkverbindung

source: Week
de: Woche

source: Close
de: Schließen

source: Courses
de: Kurse

# noAdditionalInformation
source: No additional information available
de: Keine zusätzlichen Informationen verfügbar

source: Search Teachers
de: Lehrer suchen

# teacherAbbreviationHint
source: Teacher abbreviation (like "AB")
de: Lehrerkürzel (z.B. "AB")

# selectedDate
source: Selected Date: {day}.{month}.{year}
de: Ausgewähltes Datum: {day}.{month}.{year}

source: See
de: Ansehen

# scanningTeacherAbbreviations
source: Scanning all Teacher abbreviations...
de: Scanne alle Lehrerkürzel...

source: No teachers found
de: Keine Lehrer gefunden

source: No favorite classes found.
de: Keine Lieblingsklassen gefunden.

# addClassToFavoritesForAnalysis
source: Please add a class to your favorites to see the analysis.
de: Bitte füge eine Klasse zu deinen Favoriten hinzu, um die Analyse zu sehen.

source: Could not load VPlan data.
de: VPlan-Daten konnten nicht geladen werden.

source: No data for analysis available.
de: Keine Daten für Analyse verfügbar.

# teacherLabel
source: Teacher: {name}
de: Lehrer: {name}

# lessonDetails
source: {count}. Hour: {lesson} in Room: {place}
de: {count}. Stunde: {lesson} im Raum: {place}

source: Loading data...
de: Lade Daten...

source: Loading substitution plan...
de: Lade Vertretungsplan...

source: Substitution plan loaded
de: Vertretungsplan geladen

# noSubstitutionPlanToday
source: No Substitution plan available for today.
de: Kein Vertretungsplan für heute verfügbar.

# noSubstitutionPlanTomorrow
source: No Substitution plan available for tomorrow.
de: Kein Vertretungsplan für morgen verfügbar.

source: Browsing plan...
de: Durchsuche Plan...

source: Analysing Rooms...
de: Analysiere Räume...

# checkRoom
source: Check room {room}...
de: Überprüfe Raum {room}...

source: Lessons in this room
de: Stunden in diesem Raum

source: Today no lessons in this room
de: Heute keine Stunden in diesem Raum

source: Choose time and day
de: Zeit und Tag wählen

source: Today
de: Heute

source: Tomorrow
de: Morgen

source: Cancel
de: Abbrechen

# processCanTakeSeconds
source: This process can take a few seconds!
de: Dieser Vorgang kann einige Sekunden dauern!

source: loading...
de: lade...

# classesFromTeacher
source: Classes from {teacherName} - {displayDate}
de: Klassen von {teacherName} - {displayDate}

# settingsCredentials
source: Credentials
de: Anmeldeinformationen

# settingsNotifications
source: Notifications
de: Benachrichtigungen

# settingsSetTeacherAbbreviations
source: Set Teacher abbreviations
de: Lehrerkürzel festlegen

source: Real name
de: Echter Name

source: Saved!
de: Fertig!

source: Save
de: Speichern

source: School-number
de: Schulnummer

source: Username
de: Benutzername

source: Password
de: Passwort

# selfHost
source: Your own URL
de: Eigene URL

# useSelfHost
source: or use your own URL
de: oder nutze deine eigene URL

# useLogin
source: or use official Login
de: oder nutze den offiziellen Login

# shareCreds
source: Share credentials
de: Zugangsdaten teilen

# credsSaved
source: Credentials saved!
de: Zugangsdaten gespeichert!

# loadPlanAuto
source: Load Substitution plan automatically
de: Vertretungsplan im Hintergrund laden

source: General
de: Allgemein

# smartNotifs
source: Smart notifications
de: Intelligente Benachrichtigungen

# prefClasses
source: Preferred classes
de: Bevorzugte Klassen

source: Other
de: Andere

# callInterv
source: Call interval
de: Abrufintervall

# interv
source: Interval
de: Intervall

source: Minutes
de: Minuten

source: Hours
de: Stunden

# onlyRemOnChange
source: Only remind when lesson changes
de: Nur bei Änderung benachrichtigen
